{
    "GriffinSupplier FullName": "Griffin Stationed at Tarkov Base",
    "GriffinSupplier FirstName": "Griffin Stationed at Tarkov Base",
    "GriffinSupplier Nickname": "Griffin Stationed at Tarkov Base",
    "GriffinSupplier Location": "Tarkov Port",
    "GriffinSupplier Description": "A port occupied by Griffin in Tarkov, used to receive strategic materials and prepare for upcoming operations",
    "G&K": "G&K",
    "GriffinSupplier": "Griffin Resource Repository",
    "Digital mind update": "Mind Upgrade",
    "Text": "Text Material",
    "IOP": "IOP",
    "Experimental ammo": "Experimental Ammunition",
    "introductionmission01": "Watch the Prologue",
    "introduction name": "Prologue",
    "introduction description": "Hello! First, thank you for downloading and playing this MOD. If you encounter any problems or have any thoughts during the game, you can join the QQ group: 941138824. The following plot about 'Before Dawn' is purely fictional and any resemblance is purely coincidental. I'm not a novelist and I'm not confident in my writing, so I don't recommend reading the following content with high expectations. If you want to criticize, please go easy. My modeling skills are not high, and I cannot fully restore some old accessories that might need to be changed but haven't yet. These will be gradually addressed in subsequent updates. Although my abilities are weak, I will do my best. Finally, I wish you a happy gaming experience.",
    "introduction startedMessageText": "",
    "introduction successMessageText": "Please continue to the next part of the plot",
    "main001mission01": "Watch the Story",
    "main001 name": "Prelude 0-1",
    "main001 description": "Facing the sticky sea breeze, you stand at the bow of the ship looking at the busy port in front of you, where huge loaders are preparing to unload container after container from the ship. You, leaning on a cane, hobble down the gangway. At the end of the gangway stands a group of people, with their focus on you. In the middle of the crowd stands a woman in uniform, who looks more Asian than European, her round face, white skin, and waist-length pale blonde hair leaving a deep impression on you. As you approach her, she smiles and performs a greeting. 'Hello Commander, my name is Angelina, and I will be your logistics officer during your duty period in Tarkov. Being assigned to command in a war zone, I believe you must have outstanding abilities and are trustworthy.' You: 'You flatter me, I don't have much experience working at Griffin, I don't think I'm an outstanding commander.' 'Don't worry too much, I will assist the commander with all my strength.' Then, you follow Angelina to the command center to report to Griffin. On the communication screen, a stern man with sharp eyes looks at you, he is Griffin's acting officer John Chris. 'Good, you've arrived, from now on you are in charge of Griffin's operations in Tarkov. The employer has not yet sent a communication, your current goal is to hold the base and wait for the next instructions.' You indicate there are no problems after which Chris hangs up.",
    "main001 startedMessageText": "",
    "main001 successMessageText": "Please continue to the next part of the plot",
    "main002mission01": "Watch the Story",
    "main002 name": "Prelude 0-2",
    "main002 description": "It's obvious that you are a commander of Griffin, but why were you sent to command the operations in Tarkov? Griffin explains it this way: 'Commander, we are short of hands, and you have enough capability to handle this operation, so Griffin hopes to let new commanders take your place to manage the easier S14 sector.' Well, you're not satisfied with this explanation, anyway, the Griffin higher-ups have decided to throw you over here (maybe you volunteered yourself?).",
    "main002 startedMessageText": "",
    "main002 successMessageText": "Please continue to the next part of the plot",
    "main003 visittext01": "Investigate the house on SCAV Island",
    "main003 name": "Prelude 0-3",
    "main003 description": "The next day, when you arrive at the command center, Angelina is already busy. 'Hello Commander, please command today's reconnaissance operation, and also familiarize yourself with Tarkov's terrain. Huh? Of course, I'm not saying that because I want to... Ah, just go around that island.'",
    "main003 startedMessageText": "",
    "main003 successMessageText": "The reconnaissance operation went smoothly.",
    "main004mission01": "Watch the Story",
    "main004 name": "Prelude 0-4",
    "main004 description": "Angelina: 'That's all for today then, I've already dispatched a patrol squad, they will notify us if anything happens. Next, I'll take you to familiarize with the various departments! First is the supply department, where many models of humanoid and a large amount of accessories are provided, there are also some custom parts for humanoids, these accessories have been adjusted for adaptability, usually performing better than the originals. Later, you can also upgrade the mind of the humanoids here, greatly enhancing the capabilities of the humanoids.'",
    "main004 startedMessageText": "",
    "main004 successMessageText": "Please continue to the next part of the plot",
    "main005mission01": "Watch the Story",
    "main005 name": "Prelude 0-5",
    "main005 description": "Angelina: 'Next is the repair station, here you can repair damaged humanoids or equipment, although it looks messy now, but the quality of the repairs is absolutely first-class. Finally is the logistics department, they will be responsible for ensuring the normal operation of the base, if the humanoids are lost in battle, you can also send them to retrieve the lost humanoids, but it needs to be explained in advance... the humanoids are so cute, commander should not lose them, if they are captured by the enemy and something excessive is done to them, uh, just thinking about it is scary.'",
    "main005 startedMessageText": "",
    "main005 successMessageText": "Please continue to the next part of the plot",
    "main006mission01": "Kill 5 SCAV on the coastline",
    "main006 name": "First Campaign: Rooting 1-1 Prevent Overflow",
    "main006 description": "Chris: 'Commander, I think you must be concerned about whether the military will react to Griffin and BEAR's hostile status in the Novinsk region, the answer is definitely yes, both are managed by the post-Soviet government, but the existence of BEAR itself is to do some dirty work that the military finds inconvenient, so the military will not admit their relationship with BEAR. Recently, during our negotiations with the military, they also showed dissatisfaction with this operation, we will handle this aspect well, you don't need to worry. Also, the military has not shared the latest technology with BEAR, and heavy weapons are not allowed into the Novinsk region, so you don't have to worry about encountering too powerful enemies, but you can't take it lightly for any possible retaliation from BEAR, remember, never underestimate the enemy. Here's a document about the situation in Novinsk, it can help you understand the current situation.' After the communication ended, you analyzed the environment around the base and decided to clear some nearby SCAV before any possible retaliatory action from BEAR to reduce pressure in the upcoming operations.",
    "main006 startedMessageText": "",
    "main006 successMessageText": "The attack went very smoothly.",
    "main007 visittext01": "Check the truck on the construction site next to the port",
    "main007 name": "First Campaign: Rooting 1-2 Special Aid Part1",
    "main007 description": "There hasn't been much movement from BEAR these two days, you prepare to send out humanoids for reconnaissance as usual. Angelina: 'Commander, the humanoids previously sent out for reconnaissance discovered an abandoned truck next to the port, it seems to be a humanitarian aid transport truck. There might be some supplies inside. Send the humanoids to check it out.'",
    "main007 startedMessageText": "",
    "main007 successMessageText": "Please continue to read the next part of the story",
    "main008mission01": "Watch the Story",
    "main008 name": "First Campaign: Rooting 1-2 Special Aid Part2",
    "main008 description": "Glock 17: 'This should be it, hurry up and open it.' M1911: 'Be careful, what if there's a bomb?' Glock 17: 'Then what should we do? Looking at your expression... you have a plan, right?' M1911: 'Simple, you open the box, MP5 and I will back off.' Glock 17: 'Hey? Hey! That sounds too much.' MP5: 'That... maybe I should do it.' M1911: 'Then we'll go to the back first.' MP5: 'Wow!' M1911: 'Did you find something!?' MP5: 'It's all weapons and medicine inside! Humanitarian aid shouldn't be these things. This is not humanitarian aid!' M1911: 'There's also a note here... hidden medical raw materials in the sanatorium? Anyway, contact the command center first.' So USEC also used this way to transport supplies, as for the medical raw materials, let's find them after the situation stabilizes, you thought.",
    "main008 startedMessageText": "",
    "main008 successMessageText": "Please continue to the next part of the plot",
    "main009_visit_text_01": "Find the crash site of the first drone on the coastline",
    "main009_find_01": "Find a SAS hard drive on the first crashed drone",
    "main009_visit_text_02": "Find the crash site of the second drone on the coastline",
    "main009_find_02": "Find a SAS hard drive on the second crashed drone",
    "main009 name": "First Campaign: Rooting 1-3 Ground Eagle Part1",
    "main009 description": "Last time during reconnaissance, the humanoids found two crashed drones, one on the hill opposite the base and another in the valley behind the sanatorium, you decide to send a team of humanoids to try to find some useful information from them.",
    "main009 startedMessageText": "",
    "main009 successMessageText": "Please continue to read the next part of the story",
    "main010mission01": "Watch the Story",
    "main010 name": "First Campaign: Rooting 1-3 Ground Eagle Part2",
    "main010 description": "G36: 'I'm going to upload the data, M14 and M21 keep watch around.' M14: 'Mm-hmm, we understand!' The three spread out to perform their tasks, a few minutes later... G36: 'I'm almost done over here' M21: 'M14, I've got a few SCAV coming over here... if there's nothing going on your side, come over and help me take a few shots.' M14: 'M14 here is clear, we're coming to help you.' M21: 'Good, then you just... hey! Wait! Don't go that way!' After a chaotic firefight... G36: 'Upload complete! M21, are you guys okay, I'm coming!' M21: 'Ha, it's over, M14! Are you okay?' M14: 'Knee joint damaged...' M21 rushed over and grabbed M14's shoulder M21: 'Really! Why did you just rush over like that!' M14: 'We wanted to help the squad complete the mission...' M21: 'But you can't just rush around like that! It's too dangerous.' M14: 'M14 understands...'",
    "main010 startedMessageText": "",
    "main010 successMessageText": "Please continue to the next part of the story.",
    "main011mission01": "Kill 3 BEAR on the coastline",
    "main011 name": "First Campaign: Rooting 1-4 First Strike Part1",
    "main011 description": "Mosin-Nagant: 'This is the area, spread out and recon.' Tokarev: 'Hey? There's someone over there!' Mosin-Nagant: 'Let's follow them and see.' A few people quickened their pace, using the cover of the bushes to follow up, inside the weather station, a group of BEARs were organizing equipment. PPSh-41: 'A lot of them!' Mosin-Nagant: 'They must be here to attack the base, we have to hurry and inform the commander.' At that moment you were in the command room eating lunch when you suddenly learned of the enemy assembly. You believe that the enemy is not yet fully prepared, and if a harassment attack is launched now, it should achieve good results, so you dispatched another squad to meet up with Mosin-Nagant's group, and launched an attack together.",
    "main011 successMessageText": "Please continue to read the next part of the story",
    "main012mission01": "Watch the Story",
    "main012 name": "First Campaign: Rooting 1-4 First Strike Part2",
    "main012 description": "Tokarev: 'They're here!' AK-74M: 'Commander, I've met up with the advance troops, standing by... attack?... received. Mosin-Nagant, you provide fire support from the outskirts, I'll handle the flanking attack, the others launch the attack from around the weather station. This time the attack's goal is not to annihilate the enemy, just about right, don't go too far.' After a while... PPSh-41: 'We're in position.' AS Val: 'I and OTs-12 are also ready.' AK-74M: 'Action begins.' Gunshots erupted from all around, a few BEARs hadn't reacted before falling down, the remaining BEAR PMC took cover behind barricades and stubbornly resisted... The gunfire lasted a few minutes. AK-74M: 'That's about it, let's retreat.' Tokarev: 'There are BEARs below trying to block the escape route!' AK-74M: 'I'll hold them off, you guys go!' After everyone retreated from the mountain... AK-74M: 'Is everyone down, my turn.' At that moment, a barrage of stray bullets hit AK-74M. AS Val: 'AK-74M...AK-74M, I have to go back and help her!' AK-74M: 'I can't walk anymore, forget about me, retreat back to the base!' OTs-12: 'AS Val! AK-74M was injured to cover us, if you go back now it would be unfair to her!' AS Val: 'Ah...!' In order not to fall into BEAR's hands, AK-74M activated the self-destruct program...",
    "main012 startedMessageText": "",
    "main012 successMessageText": "Please continue to the next part of the story",
    "main013mission01": "Kill 5 BEAR",
    "main013 name": "First Campaign: Rooting 1-5 Defend the Base Part1",
    "main013 description": "The attacking troops retreated back, being urgently sent to the repair station for repairs. Not long after, BEAR chased over, you used all the combat-ready humanoids to strengthen the base's defenses, while also sending out a squad from outside the base to flank the enemy.",
    "main013 startedMessageText": "",
    "main013 successMessageText": "Please continue to read the next part of the story",
    "main014mission01": "Watch the Story",
    "main014 name": "First Campaign: Rooting 1-5 Defend the Base Part2",
    "main014 description": "You: 'M1911, now!' M1911: 'Let's start.' Gunshots came from the flank, BEAR's attack became chaotic, but soon, BEAR reacted and launched an attack on the humanoid on the flank. You: 'You guys get out of there, disengage from the fight and then find an opportunity to ambush.' After several rounds of attrition, BEAR's attack gradually seemed powerless. However, the situation inside the base was not optimistic M21: 'M14, several enemies are rushing down from the 11 o'clock direction!' PPSh-14: 'Mosin-Nagant!' In such an environment where bullets and parts were flying around, and having just lost a close teammate, AS Val's mind became more chaotic. At that moment, something rolled to AS Val's feet. AS Val: 'This is... a grenade!' OTs-12: 'Get away!' OTs-12 rushed forward, pouncing on AS Val. AS Val fell backwards, before her head hit the ground, an explosion sounded, and the figure in front of her became blurry. AS Val: 'OTs-12!' AS Val got up from the ground, hugged OTs-12 lying on the ground. OTs-12's mind was damaged, her legs were broken, and her body was covered with small cuts from fragments. Teddy bear lay quietly aside, silently watching AS Val holding OTs-12's body and crying. AS Val: 'Why... why...' After a tough resistance, BEAR finally began to retreat. Glock 17: 'Really thanks to the BOSS, it was so easy to drive BEAR away.' M1911: 'Hehe, Darling is really trustworthy.' Inside the base, the repair station under Angelina's management was running at high speed, lightly damaged humanoids lined up outside the repair station, while the remaining intact humanoids and staff constantly moved the scattered parts on the ground. Although the base was held down, you did not feel happy, AK-74M, and the humanoids that were completely destroyed in the defense... After this battle, whether it was BEAR or Griffin, it would be difficult to carry out the next step of action for a while. AS Val, sitting alone by the roadside, bowed her head, letting others come and go, moving things around. AS Val: 'It's just me and teddy bear left... they all died for me, would teddy bear also blame me...' At that moment, M1911 and others passed by on the road, seeing the lone, sad AS Val... M1911: 'We've lost a few reliable humanoids, AS Val and AK-74M and OTs-12 were a team, weren't they? They were very outstanding humanoids.' Glock 17: 'Yes, such outstanding humanoids, the BOSS will definitely rebuild them first.' MP5: 'Definitely, once the factory is built, they will come back.' AS Val: 'But without them, what should I do... they are my only friends in Griffin... also everyone's friends... they all died for me, why wasn't it me...' Saying this, AS Val hugged the teddy bear even tighter, as if trying to stuff teddy bear into her chest. M1911: 'Don't think like that, no humanoid is unimportant. You don't be too sad, after a few days when new humanoids are sent, the commander will arrange new teammates for you, then you will have new teammates...' AS Val suddenly stood up and walked away without turning her head. M1911: 'Hey? Wait!' MP5: 'Said the wrong thing.' M1911: 'Sigh... really tiring, hope nothing big happens.'",
    "main014 startedMessageText": "",
    "main014 successMessageText": "Please continue to the next part of the story",
    "main015mission01": "Watch the Story",
    "main015 name": "Second Campaign: Awakening 2-1 A New Start",
    "main015 description": "M1911: 'Darling!' You: 'Ah! Why are you calling me that?' M1911: 'Because... I'll tell you later, AS Val, she...' M1911 talked about AS Val's situation... You: 'This matter has hit her hard, indeed, ever since she formed a team with AK-74M and others, I always saw the three of them together, and OTs-12 was blown to pieces right in front of her, I can understand that feeling... the day after tomorrow new humanoids are coming, and the construction of the factory is probably going to take a few more weeks to complete, if she doesn't want to idle around, she can only be persuaded to accept new teammates.' After the conversation with M1911, you went to the humanoid dormitory. You knocked on the door, after a long while, the door opened a crack. AS Val: 'Who is it? Commander! What's up?' You: 'I came to ask you, do you still want to participate in battles?' AS Val: 'Of course!' You: 'Then would you like to form a new team with the new humanoids the day after tomorrow, return to the battle, or would you rather wait a few weeks later, and rejoin the battle with the rebuilt AK-74M and OTs-12? If you choose the former, I will consider arranging you in a team when AK-74M and OTs-12 are rebuilt, if you choose the latter, then I might have to consider throwing you into a cafe for a while. How about it?' AS Val: 'Since you've said that, then I'll join the new team...' You: 'Don't worry too much, maybe the new teammates are also very good.'",
    "main015 startedMessageText": "",
    "main015 successMessageText": "Please continue to the next part of the story",
    "main016handover01": "Provide three wires found in the battlefield",
    "main016handover02": "Provide three printed circuit boards found in the battlefield",
    "main016handover03": "Provide a power unit found in the battlefield",
    "main016 name": "Second Campaign: Awakening 2-2 Repair",
    "main016 description": "Angelina: 'Ah... my brain is going to break... Commander, a lot of electronic equipment is damaged, and the spare parts have already run out, this list is what we're missing, can you ask a few humanoids to find some parts and bring them back?' You: 'Of course no problem, you've worked hard, if you're too tired, take a rest.' Angelina: 'But there are really too many things to handle...'",
    "main016 startedMessageText": "",
    "main016 successMessageText": "",
    "main017mission01": "Watch the Story",
    "main017 name": "Second Campaign: Awakening 2-3 Strangers Part1",
    "main017 description": "Two days have passed, the supply fleet arrived as scheduled. Chris: 'Commander, for some reason, the next supply will be delayed, please conserve the current resources and act cautiously.' You: 'I understand.' Communication ended... You: 'In that case, we can't carry out large-scale operations recently, take it slow.' Angelina: 'Commander, I heard that the supply in other battle zones has also been delayed, there must have been something serious.' You: 'I think so too, but we are powerless. By the way, call all the humanoids to the open space next to the command center, I want to personally arrange the new formation.' Angelina: 'Not using the system?' You: 'No, I prefer to say it in person.' Angelina: 'But your leg...' You: 'My leg is fine, I'm not disabled.'",
    "main017 startedMessageText": "",
    "main017 successMessageText": "Please continue to read the next part of the story",
    "main018mission01": "Watch the Story",
    "main018 name": "Second Campaign: Awakening 2-3 Strangers Part2",
    "main018 description": "UMP45: 'Actually, I think 40 would make a better leader.' UMP40: 'Why?' UMP45: 'I always feel like I'll mess things up, if it's 40, she can handle things more smoothly, plus she already has experience.' UMP40: 'I worry about not doing well too, but the important thing is, as a leader, you need to have the responsibility of a leader, since you've been chosen as a leader, just take responsibility.' UMP9: 'I really don't understand you guys, what's the use of arguing about this...' AS Val: 'They seem to get along really well, even though it's their first meeting, they're like they've known each other for a long time. I'm jealous, but I have teddy bear with me, so I'm happy too...' UMP40: 'AS Val was one of the first humanoids to come here, right?' AS Val: 'Ah, yes...' UMP40: 'Who were your teammates before?' AS Val: 'AK-74M and OTs-12, they're both dead...' UMP9: 'Hey!?' UMP45: 'Ah...' UMP40: 'Sorry, I asked about a sad thing.' AS Val: '...' UMP40: 'This teddy bear is so cute, is it customized?' AS Val: 'Mm, it's one of my best friends.' UMP40: 'It's very important to you. May I see it?' AS Val handed over the teddy bear. UMP40: 'So cute, I also want to be friends with teddy bear, is that okay?' AS Val: 'Of course.' UMP40: 'Hello teddy bear, nice to meet you.' UMP45: 'Teddy bear seems happy.' UMP9 also came forward to play with teddy bear. UMP45: 'By the way, I heard a restaurant just opened here, let's try it.' UMP40: 'I heard the restaurant is quite good.' UMP9: 'Since the leader is taking responsibility, the first meal should be on the leader~' UMP45: 'Why would the leader have such a responsibility.' UMP40: 'Well, in the team I was in before, it was customary for the leader to treat the first meal.' UMP45: 'Hmm, no choice then, okay, I'll treat, but only this once.'",
    "main018 startedMessageText": "",
    "main018 successMessageText": "Please continue to the next part of the story",
    "main019mission01": "Find hidden medical raw materials at the damaged part of the underground swimming pool in the western building of the sanatorium",
    "main019 name": "Second Campaign: Awakening 2-4 Mysterious Goods Part1",
    "main019 description": "The supplies have been delivered, BEAR's retaliation has also ended, before any new instructions, you decide to first investigate the medical raw materials found earlier.",
    "main019 startedMessageText": "",
    "main019 successMessageText": "Please continue to read the next part of the story",
    "main020mission01": "Watch the Story",
    "main020 description": "UMP three went downstairs to search for the target, AS Val stood guard at the stairwell UMP9: 'Found it, it should be these.' The three worked together to move the shelf blocking the hole, the hole was filled with boxes. Most of the boxes had been emptied, only a few syringes and scattered pills remained. While the three were still reporting the findings to the command center below, several SCAVs were cautiously collecting resources in the sanatorium. AS Val: 'Sigh, they three are really good friends, I'm envious, but having teddy bear with me, I'm also very happy... but I still miss AK-74M and the others, teddy bear does too, right?' Suddenly, gunfire startled AS Val, and she was pushed back as if forcefully. AS Val: 'Ugh! Damn it. SCAV found me!' UMP three rushed over, worked together to eliminate the remaining SCAVs. UMP45: 'Are you okay?' AS Val: 'My fire control system is broken, what if I encounter enemies.' UMP45: 'We'll cover you, let's retreat back to base.' On the way back to base, the group encountered a group of SCAVs at the base of the communication station hill. To cover the others' retreat, UMP45 threw a smoke grenade. UMP45: 'You guys go around the other side, I'll hold the rear.' But before they got far, they encountered SCAVs who had circled from the foot of the mountain, UMP40 and UMP9 went forward to block, AS Val was caught in the middle. AS Val: 'I can't just stand here, I have to help.' At that moment, a SCAV appeared on the mountain top, AS Val emptied a magazine but didn't hit the target. AS Val: 'Without the fire control system, I really can't shoot accurately. But, I can't always be protected by others.' AS Val carefully aimed at the mountain top, as the SCAV reappeared, AS Val fired a few shots, the hit SCAV fell from the mountain top. AS Val: 'Hit!' Two more SCAVs appeared on the mountain top. UMP9 pulled AS Val back, bullets whizzed by. UMP9 threw a flash grenade towards the mountain, then peeked out, killing the two SCAVs on the mountain top. The rest of the SCAVs were quickly defeated, the group finally returned to the base. UMP45: 'Finally back.' AS Val: 'Sorry, I dragged behind again...' UMP9: 'Next time, I'll just leave you alone.' UMP40 (laughing): 'Don't mind her, she's just talking.'",
    "main020 startedMessageText": "",
    "main020 successMessageText": "Please continue to the next part of the story",
    "main021mission01": "Kill 5 USEC",
    "mainput1021": "Place 5 USEC dog tags found in the battlefield at ZB-106",
    "main021 name": "Second Campaign: Awakening 2-5 Employer Part1",
    "main021 description": "Chris: 'The employer of this mercenary operation will give you instructions, he will contact you in a while.' Employer: 'Are you the commander in charge of the Novinsk operation, I hope Griffin's team can satisfy me, and not like those incompetent and always betraying guys. Let me see your strength first, go kill five USEC, then put their dog tags inside the bunker at ZB-106 near the crashed plane east of the logging site.'",
    "main021 startedMessageText": "",
    "main021 successMessageText": "Please continue to read the next part of the story",
    "main022mission01": "Watch the Story",
    "main022 name": "Second Campaign: Awakening 2-5 Employer Part2",
    "main022 description": "UMP45 commanded the team to surround two USECs collecting resources inside a house. Just as UMP9 was about to throw a flash grenade through the window, one of them noticed UMP9. A barrage of bullets flew out of the window, and UMP9 immediately fell down, the remaining humanoids seeing this quickly stormed into the house, killing the unresponsive USEC. UMP45 ran to UMP9, holding the motionless UMP9. UMP45: '9!' UMP40 and AS Val also gathered around. UMP40: 'The core damage is too severe, it's beyond repair...' UMP45: 'No... if it wasn't for my order to throw the flash grenade... this wouldn't have happened...' UMP40: 'Fool' AS Val: '...' UMP45: 'This is why you should be the leader, you are more rational, more experienced, can make the right decisions.' UMP40: 'I'm not better than you, you just need some experience, you are the one who should be the leader.' UMP45: 'Why' UMP40: 'Because I was... because I believe in you. Since the commander chose you, you should take responsibility, do what you need to do. I know, you can become a very good leader.' Employer: 'I got the dog tags, truly professional mercenaries, much more efficient than my former subordinates.'",
    "main022 startedMessageText": "",
    "main022 successMessageText": "Please continue to the next part of the story",
    "mainput1023": "Place 10 cans of stewed beef in ZB-106.",
    "mainput2023": "Place 10 bottles of 0.6-liter bottled water in ZB-106.",
    "main023 name": "Third Campaign: Turbid Clouds 3-1 Food Part1",
    "main023 description": "Employer: 'Commander, I need you to collect some food for me, 5 cans of stewed beef and 5 bottles of mineral water, once done place them in ZB-106 bunker.'",
    "main023 startedMessageText": "",
    "main023 successMessageText": "Please continue to read the next part of the story",
    "main024mission01": "Watch the Story",
    "main024 name": "Third Campaign: Turbid Clouds 3-1 Food Part2",
    "main024 description": "M9: 'Really, so much food, feels like a lunch lady.' M1911: 'Be careful the commander hears you and dislikes you.' M9: 'My popularity with the commander is also top-ranked, how could he possibly dislike me.' M1911: 'That's not necessarily true, Darling is very serious.' M9: 'Hmph, you've been in service for so long, the commander should like me more, a shining new star.' M1911: 'Just a bit newer than me! Besides, the commander isn't just interested in new humanoids. By the way, I've already had a private chat with Darling before you came~' M9: 'You! I'll prove that I'm the most favored by the commander! You old lady just wait and see!' M1911: 'Who did you call an old lady!' MP5: 'Sigh...'",
    "main024 startedMessageText": "",
    "main024 successMessageText": "Please continue to the next part of the story",
    "mainfind025": "Find a box on a bucket in room 108 of the eastern building of the sanatorium",
    "mainhandover025": "Hand over the box",
    "main025 name": "Third Campaign: Turbid Clouds 3-2 Secret Box Part1",
    "main025 description": "Employer: 'Commander, there's a black small box in room 108 of the eastern building of the sanatorium, it should be on top of a bucket, get it back, then I'll personally send someone to pick it up, don't damage it, and don't open it to look!' You: 'I understand.' Employer hangs up the call Angelina: 'Hard work, commander, I made you some coffee.' You pick up the cup, a rich aromatic smell comes wafting up. You bring the cup to your lips, sip lightly, a sweet flavor fills your mouth, the sweetness and milk flavor are just right. You: 'Really good! Great skills.' Angelina smiles and says: 'This is something I learned when I was a kid with my father, his coffee was also very popular in the army.' You: 'Feels like this cup of coffee can dispel all the fatigue.' Angelina: 'Then I'll often make it for you to drink.' You: 'That would be too blissful.'",
    "main025 startedMessageText": "",
    "main025 successMessageText": "Please continue to read the next part of the story",
    "main026mission01": "Watch the Story",
    "main026 name": "Third Campaign: Turbid Clouds 3-2 Secret Box Part2",
    "main026 description": "Employer: 'I've got the box now, well done.' Chris: 'Is this related to the specimens?' Employer: 'Yes, this is a purchase list from Terragroup Labs.' Chris: 'Why don't you let Griffin handle the intelligence?' Employer: 'Because I want to see the information myself, to prevent you from deceiving me.' Chris: 'Alright, but we hope you can share the data with Griffin. Also, don't forget the agreement with Griffin, Griffin also wants a share of the specimens found.' Employer: 'Don't worry, I'll keep my word. But, I really don't understand what you guys are going to do with these things, use them for robots?' After saying this, the employer hangs up the call. Chris shakes his head, also hangs up the call.",
    "main026 startedMessageText": "",
    "main026 successMessageText": "Please continue to the next part of the story",
    "main027mission01": "Watch the Story",
    "main027 name": "Third Campaign: Turbid Clouds 3-3 Butterfly Operation",
    "main027 description": "Chris: 'Commander, I think you'd like to know what's been happening lately, the upper levels have permitted me to tell you. Not long ago, Griffin carried out an operation called 'Butterfly Operation', a Griffin team infiltrated the technical department of the Iron Blood main factory, attempting to steal 'Eliza's programming data, but the operation failed, Griffin's team suffered heavy losses, Iron Blood humanoids also launched an attack on Griffin under AI control. The cause of the failure is currently unknown.' You: 'The situation doesn't look good, it's going to be tough going forward.' Chris: 'You've been through resource shortages during the Third War, haven't you?' You: 'Yes... that time was really tough.' Chris: 'I believe you can get through this difficult period this time too.'",
    "main027 startedMessageText": "",
    "main027 successMessageText": "Please continue to the next part of the story",
    "main028mission01": "Kill 5 SCAV in the forest",
    "main028 name": "Third Campaign: Turbid Clouds 3-4 Revenge part1",
    "main028 description": "Employer: 'Commander! There are a few damned things in the forest that killed one of my assistants, send your people to kill them.' You: 'Sorry, who?' Employer: 'Those damn garbage pickers who scavenge all day long!'",
    "main028 startedMessageText": "",
    "main028 successMessageText": "Please continue to read the next part of the story",
    "main029mission01": "Watch the Story",
    "main029 name": "Third Campaign: Turbid Clouds 3-4 Revenge part2",
    "main029 description": "G36: 'Five SCAVs spotted ahead.' G36: 'S-SASS, M21, find a concealed spot to snipe, M14, G36C, and I will ambush from the front.' The SCAVs lit a fire, happily chatting. The tranquility was shattered by gunfire, instantly two of their brains splattered on the ground, the remaining SCAVs panicked looking for cover. SCAV1: 'Damn bastards! I'll kill them!' SCAV2: 'Let's circle around this way!' SCAV1: 'Go! Let's show these ignorant things some color.' SCAV2: 'Ah!' SCAV1: 'It's an ambush! Is, is it girls? Are they the girls they talked about!' The SCAVs angrily fired into the woods. A bullet hit his arm, blood flowing non-stop. He recoiled, bullets crazily hitting the tree trunk he was hiding behind. SCAV1: 'This firepower, too fierce!' The other two SCAVs were also killed. He was scared, decided to run, and seized the moment to rush towards the rear cover, bullets flying past, he ran recklessly. A bullet pierced his calf, he fell to the ground. Memories of joyful times with his brother and family flashed through his mind, USEC's intervention had shattered this beautiful life, to make a living, he and his brother joined the SCAV organization. Not long ago, his brother was killed while collecting supplies in the sanatorium, according to others, it was the new organization's people who brutally killed his brother, the organization's fighters were all girls, wearing strange clothes, yet their combat capability was very strong. SCAV1: 'Brother... I can't avenge you...' A bullet pierced his chest, in pain and sorrow, he slowly closed his eyes. G36: 'Mission complete, no one got hurt, right?' G36C: 'G36C is fine.' M14: 'M14 was hit, but it's not serious.' M21: 'All good here.' G36: 'Then let's head back.' M21: 'S-SASS shoots really accurately, much better than me.' S-SASS: 'Is, is that so.' M21: 'I've seen you secretly practicing at the training ground.' S-SASS: 'Ah? I feel like I'm not doing well enough, so...' M21: 'Very good.' S-SASS: 'Thank, thank you.'",
    "main029 startedMessageText": "",
    "main029 successMessageText": "Please continue to the next part of the story",
    "main030 visittext01": "Search for the convoy in the northwest of the forest",
    "main030 visittext02": "Search for the USEC camp in the northwest of the forest",
    "main030 name": "Third Campaign: Turbid Clouds 3-5 Convoy part1",
    "main030 description": "Employer: 'Cough, my informant told me that earlier today, there was a fight in the northwest of the forest, some USEC attacked a convoy. Send your people to see what's left of the convoy and check if they've camped nearby.' Communication ends. Chris: 'Good afternoon, Commander, has the employer still not let you look for the experimental items?' You: 'That's right.' Chris: 'Well, take it slow. Things are tough for Griffin on this end, and the iron blood offensive is getting fiercer, while S09 is facing iron blood with a newly appointed commander. Although I hear this commander is quite capable, I still think it’s too bold.' You: 'Griffin is short of hands.' Chris: 'Right, the top management plans to cancel some contracts and send more dolls and commanders to the front line against iron blood.' You: 'Could the assignments here in Tarkov be canceled?' Chris: 'I don’t think so; 16Lab is quite interested in the experimental items you guys are looking for. Commander, if you could decide, would you want the Novinsk operation canceled?' You: 'I would like to cancel the operation. It’s hard to say what will happen as we can’t guarantee the supply of resources.' Chris: 'That's indeed a big issue, but we'll maintain the supply chain.' You: 'By the way, what does the military think of the Butterfly Operation?' Chris: 'They’re not too concerned about it, but their attitude towards Griffin has worsened.'",
    "main030 startedMessageText": "",
    "main030 successMessageText": "Please continue reading the next part of the story.",
    "main031 description": "You: 'The dolls found no remaining supplies in the convoy, and on a hill near the convoy, they discovered a USEC camp that had already evacuated with the goods. We didn't find any useful information.' Employer: 'That's very disappointing. Aren’t your robots quite smart? Couldn’t even figure out where USEC ran off to.' You: 'I’m sorry, but USEC cleaned the camp, and the vehicles were left there; we couldn't find any clues at the scene that could indicate their direction.' Employer: 'Even my informant knows USEC went towards the lighthouse, and you can’t even figure out what some thugs are up to! Your robots might as well be thrown into a nightclub!' After saying this, the employer hangs up. Angelina: 'Out of the blue, that’s really insulting! Relying on their own information network to belittle Griffin’s dolls, and to say such excessive things.' You: 'Well, the employer has paid, and the customer is always right, even if the fruit is hard to swallow.'",
    "main031 startedMessageText": "",
    "main031 successMessageText": "Please continue reading the next part of the story.",
    "main032mission01": "Kill 3 USEC at the lighthouse",
    "main032 name": "Fourth Campaign: Companion 4-1 Person of Hope part1",
    "main032 description": "The supply ship finally docked at the port, and the factory was subsequently built. Angelina: 'Mind download complete. AK-74M, you can come out now.' AK-74M: 'Miss Angelina?' Angelina: 'You're finally back, we've missed you.' AK-74M: 'What happened?' Angelina: 'You were destroyed in the operation to protect the base while covering for your teammates' retreat.' AK-74M: 'What about OTs-12 and AS Val?' Angelina: 'I'm sorry, only AS Val is still here, OTs-12 was also destroyed. You are the first doll rebuilt by the new factory, it won't be long before OTs-12 is also rebuilt.' AK-74M: 'Thank you for the trouble, Miss Angelina. Where is AS Val now?' At this moment, at the resort near the lighthouse... UMP45: 'Mission complete, let's check again and then head back.' UMP40: 'The first doll rebuilt by the factory is coming out today, really looking forward to it, wonder who it will be.' AS Val: 'I wonder who Teddy hopes it will be, AK-74M, OTs-12, or UMP9? And there's Mosin-Nagant too. Tough choice... but they will all come back sooner or later.' A bullet hits something with a thud, a loud gunshot echoing, startling everyone present. UMP45: 'From the sewage treatment plant? That's too far, can humans really do that?' UMP45: 'Where did Val go?' UMP40: 'She fell back there!' AS Val: 'Ouch... it hurts.' AS Val: (It's my turn, Teddy...) A smoke grenade falls nearby. 'Puff', white smoke envelops AS Val and Teddy. Someone drags her back in the smoke. AS Val: (Teddy?) Hands groping around, hoping to find her beloved Teddy. AS Val: 'Teddy!' A sudden surge of emotion overwhelms her system, causing it to crash, her raised hand falling down. UMP40: 'Teddy... Teddy... found it!' UMP45: 'Is she, is she dead?' UMP40: 'She's still alive, her memory module was hit, probably crashed, we need to take her back.' UMP45: 'Evacuate through the back path, you go first with her.'",
    "main032 startedMessageText": "",
    "main032 successMessageText": "请继续阅读下一部分剧情",
    "main033mission01": "观看剧情",
    "main033 name": "Fourth Campaign: Companion 4-1 Beloved One part2",
    "main033 description": "Angelina: '...That's exactly what he said, it's really too much, especially when there's no clue at all...' Communication: 'Miss Angelina, there's a damaged doll here, please come over.' Angelina: 'Sorry, I have to leave for a moment.' AK-74M: 'We'll talk next time.' Angelina ran to the repair area. UMP40 was waiting on the side, while UMP45 and AS Val were lying on the beds. Angelina: 'What happened?' UMP40: 'AS Val was hit by a gunner during a mission and has crashed, UMP45 was also hit during the retreat.' Angelina: 'Let me see... AS Val's memory module is completely unusable, it needs to be replaced, the mind is also damaged, needs to be replaced and the mind downloaded again, and the wiring needs to be redone... Why is UMP45 missing an arm?!' When Angelina finally got the repair place sorted out, she ran into AK-74M at the door. AK-74M: 'Hello, Miss Angelina, have AS Val and the others returned?' Angelina: 'I was just about to talk to you about this, AS Val was heavily damaged in action, it will take a few days to repair.' AK-74M: 'Then I will wait a few more days.' Angelina: 'Why do I feel like you're not very worried about her?' AK-74M: 'What's there to worry about.' Angelina: 'You say that, but I think you actually care a lot, don't you?' AK-74M: 'Uh, no, I...' Angelina: 'Forget it, just be a little warmer when you see AS Val, she really cares about you a lot, your death affected her greatly.' AK-74M: '...'",
    "main033 startedMessageText": "",
    "main033 successMessageText": "Please continue to read the next part of the story",
    "main034 name": "Fourth Campaign: Companion 4-2 Person of Concern part1",
    "main034 description": "Employer: 'One of my informants told me someone hid a rugged laptop in room 306 of the sanatorium's east wing, it contains information we want. I've sent over the room key, have your people retrieve it, then place it at the entrance of ZB-106.'",
    "main034 startedMessageText": "",
    "main034 successMessageText": "Please continue to read the next part of the story",
    "main035 name": "Fourth Campaign: Companion 4-2 Person of Concern part2",
    "main035 description": "On the way back to base, you keep thinking about that person, that warm and cheerful person. Mosin-Nagant: 'Since he's a new member, to close the distance, I invited him for a treat... here's your coffee.' Mosin-Nagant: 'Wow! Your accuracy has gone up again, that's the result of your hard training!' Mosin-Nagant: 'You contributed a lot in this operation, Tokarev.' Mosin-Nagant: 'Are you alright? Did you get hurt... thank goodness!' Tokarev: 'Every time I think about it, I always see the image of Mosin-Nagant dying.' Tokarev: 'During the attack on the base by BEAR, my position was almost at the front, unfortunately, my leg was shot, a grenade fell beside my shelter, to save me, Mosin-Nagant ran out from his shelter and pulled me to the back. We fell to the ground, I thought Mosin-Nagant was just tripped, but when I got up, I saw that his mind had been pierced by a bullet.' Tokarev: 'Without Mosin-Nagant, I always feel like something is missing, the team has become much quieter, I often fall into these memories. Although I look forward to Mosin-Nagant coming back these days, how should I face him if he really comes back?' After returning to the base. Mosin-Nagant: 'I'm back, is everyone okay?' PPSh-41: 'Mosin-Nagant? Long time no see, welcome back!' Tokarev: 'Miss Mosin-Nagant!' Seeing such a scene, of course, I'm happy, but inside I feel a bit guilty. Tokarev: 'Sorry, Miss Mosin-Nagant...' Mosin-Nagant: 'What?' Tokarev: 'Nothing, I'm glad you're back!' Mosin-Nagant: 'Let's go have coffee again, my treat, everyone gets one.' PPSh-41: 'How can that be, last time it was your treat, this time it's my turn.' Mosin-Nagant: 'Alright then.' Type 63: 'Do I also get one?' PPSh-41: 'Yes, every team member gets one!' Type 63 & Makarov: 'Great!'",
    "main035 startedMessageText": "",
    "main035 successMessageText": "Please continue to read the next part of the story",
    "main036 name": "Fourth Campaign: Companion 4-3 Person of Memory part1",
    "main036 description": "Employer: 'One of my men bought some intelligence, but the guy was ambushed on the way. He died, but before he died, he hid the information somewhere in the logging camp, there's a tough crowd there... Your people shouldn't have a problem finding it, right? Go retrieve it and place it in ZB-106.'",
    "main036 startedMessageText": "",
    "main036 successMessageText": "Please continue to read the next part of the story",
    "main037 name": "Fourth Campaign: Companion 4-3 Person of Memory part2",
    "main037 description": "After the mission, you decide to go to a cafe for a coffee. On the way, you meet Angelina. Angelina: 'Commander, where are you going?' You: 'I'm planning to go to the cafe for a coffee.' Angelina: 'I'm free, let me make you a coffee.' Angelina returns with two steaming cups of coffee, you take the cup and sit with her in the cafe. Angelina: 'Commander, you seem a bit unhappy these days.' You: 'How can you tell?' Angelina: 'Because these days when you see the reconstructed dolls rejoining the team, you always sigh, and you seem a bit sad when you're lecturing.' You: 'Sigh... seeing them reunite, I'm reminded of my old teammates, if only they could be reconstructed like the dolls. After the third war broke out, I couldn't continue my work, so I joined the army. After brief training, I was thrown onto the battlefield, luckily, under the protection of veterans, I learned various survival skills on the battlefield. During one operation, we were sent to raid a warehouse, I needed to lead a few people to blow up a machine gun nest before the assault, but I was too nervous, failed to destroy the machine gun, got injured, and worse, I failed to communicate in time, causing the assault team to be suppressed by machine gun fire, many were sacrificed. Since then, I've hated myself, believing I was too weak, and that I caused the death of those people, so I decided to make a change.' Angelina: 'That's how it is. But now, Commander, you've become our reliance, with the Commander here, I feel very secure.'",
    "main037 startedMessageText": "",
    "main037 successMessageText": "Please continue to read the next part of the story",
    "main038 name": "Fourth Campaign: Companion 4-4 Person of Thought part1",
    "main038 description": "Employer: 'Commander, Terragroup Labs once developed a combat stimulant called 'SJ6 TGLabs' that can enhance physical abilities, find three of them, they might be placed in common medical kits by the roadside? Anyway, this stuff could be anywhere. After finding them, put two of them in ZB-106, and keep one for yourselves to play with.' (To lower the difficulty, this task can be completed with items brought out from non-combat situations)",
    "main038 startedMessageText": "",
    "main038 successMessageText": "Please continue to read the next part of the story",
    "main039 name": "Fourth Campaign: Companion 4-4 Person of Thought part2",
    "main039 description": "G36: 'Your coffee, please enjoy.' UMP45: 'G36? Why are you working as a waitress in a cafe today?' G36: 'Since there's no mission temporarily, the Commander thought I could try working part-time at the cafe, so I came to give it a try.' UMP40: 'Is this coffee made by you? It's really good.' G36: 'Yes, Miss Angelina taught me how to make it.' UMP45: 'Really, making such good coffee, my savings are going to suffer.' G36: 'Thank you for the compliment.' UMP45: 'Wait till 9 comes back, I definitely want to treat her to a cup.' G36 couldn't help but laugh. ???: 'Okay, then pay for this cup now.' Hearing the familiar voice, UMP40 and UMP45 looked surprised toward a corner of the cafe, UMP9 walked over holding a half-finished coffee. UMP45: 'How long have you been back?' UMP9: 'Not long, I was planning to finish the coffee then go find you guys, but you guys came to me.' UMP40: 'Welcome back, 9.' UMP45: 'Drinking coffee and hiding in the corner, you really didn't want us to see you, huh. But welcome back, 9.'",
    "main039 startedMessageText": "",
    "main039 successMessageText": "Please continue to read the next part of the story",
    "main040 name": "Side Story 1: Origin",
    "main040 description": "There aren't any tasks recently, today you arrange a routine patrol task, then sit in the command room drinking tea. At this time, Angelina walks in. Angelina: 'Commander, can we talk?' You: 'Sure, what would you like to talk about?' Angelina: 'I heard that you served in the 059 Battalion, 1st Company during the third war?' You: 'Yes.' Angelina: 'Kristen, do you know him, he also served in the 059 Battalion, 1st Company, he was my brother.' You: 'I remember him, he was the company commander, right?' Angelina: 'Yes, that's right. He was killed in the 'Lion' operation, you must have participated in that battle too, can you tell me about what happened then?' You: 'It's said that the operation's files were leaked, our company was providing fire support from the rear and was attacked, the frontline troops were also surrounded during the assault. I'm not sure exactly what happened, I only know that the frontline troops were almost completely annihilated.' Angelina looked very surprised. Angelina: 'Hmm... then, tell me about what happened to your company that day.' You: 'That morning, our company arrived at one of the predetermined positions early, shortly after the operation started, our position was suddenly bombarded by enemy artillery, only me and a few others survived... uh... sorry, thinking about that scene makes me a bit nauseous. My leg was permanently damaged, and I retired from then on.' Angelina: 'My goodness, that was a terrible operation! And there's still no official report, if you hadn't told me, I wouldn't have known it was so brutal...' You: 'Because of the confidentiality agreement, they don't want this matter to spread.' Angelina: 'Then why did you join Griffin?' You: 'After that incident, I suffered from PDST, later I mostly recovered through treatment, but I could never fully accept a life away from combat, so at a friend's recommendation I joined Griffin. Why did you join Griffin?' Angelina: 'My father was a military officer, my brother and I were taught military knowledge from a young age, so I was interested in military matters. Later, influenced by him, my brother joined the military, I also thought about joining the military during the third war, but was rejected because I was too young. After the third war ended, I couldn't find the job I wanted, so I tried joining a contractor, saw Griffin's recruitment, thought the dolls were very cute and joined.'",
    "main040 startedMessageText": "",
    "main040 successMessageText": "Side Story 1 ends",
    "main041 name": "Author's Words",
    "main041 description": "Thank you very much for your support of this MOD, and also thanks to Mr. AT for his support of this MOD. Currently, there's only so much in the test version, I only wrote a few unfinished novels in my spare time before, I'm not very confident in my writing, but I will try my best to write well, if there are any deficiencies, I hope for your understanding. I will continue to update more content when I have time, in addition to the main and side storylines, there will also be narratives about the dolls' mental upgrades in Tarkov, please continue to support. As I am a high school student, I only have a bit of time on weekends during non-holiday periods, so the update speed is very slow, just this test version took a year to make, also in many aspects of MOD production I only touched the surface, and with my current level I can only rely on the game's original models by assembling, proportion modification, drawing textures, etc. to restore some firearms, so some detail problems are unavoidable, I can only achieve a 'looks like' level. This MOD evolved from a previous super module produced Girls' Frontline gun MOD, there are fewer guns than its predecessor, only the high-fidelity guns were kept, there might continue to be updates of a few guns in the future. Finally, I hope you like this MOD. Note: This MOD is a free MOD, not for commercial use.",
    "main041 startedMessageText": "",
    "main041 successMessageText": "Thank you again for your support.",
    "UMP4501_text_01": "Evacuate from any map 3 times",
    "UMP4501_text_02": "Kill 10 SCAVs with UMP45",
    "UMP4501 name": "Mind Upgrade UMP45 MOD1",
    "UMP4501 description": "UMP40: 'Wow, how long have you been practicing?' Surprised by the scattered shell casings, UMP45: 'Just 8 hours.' UMP40: '8 hours! ...Well, how did it go?' UMP45: 'Not so good...' UMP40: '25% hit rate on a 25-meter moving target... it's okay, it's improving slowly.' UMP45: 'I'm far behind you.' UMP40: 'Take it easy, you know I've been in service for a while, that's why I can achieve this. Okay, don't be sad, practicing this long might have thrown off your state, take a break and maybe you can break your record next time.' UMP45: 'After all, I have no experience, my accuracy is not high, why would the commander think I'm suitable to be a captain.' UMP40: 'The commander must have his reasons.' UMP45: 'Why do you always think I should be the captain, I clearly can't do anything right, and I even got UMP9 destroyed.' UMP40: 'Don't say that.' UMP45: 'Clearly you are the better choice.' UMP40: 'You are the one who will make an excellent captain.' UMP45: 'But do you know how hard this is for me! I lack the capability, yet I'm burdened with such expectations, I simply can't handle this responsibility! I'm scared every day that I'm not doing well, I train every day, but it's useless! I'm not like those IOP dolls that have command modules, I don't have excellent fire control modules, nor experience, how can I be a good captain! 9 was destroyed because of my mistake, Val was also severely damaged several times... I'm afraid the next one destroyed might be you or Val, or any other dolls, I don't want to see anyone else leave because of me!' UMP45 threw her gun aside, covered her face with her hands and sobbed, tears seeping through her fingers, dropping to the ground. UMP40: 'No! I'm sorry 45, I'm sorry...' UMP45: 'I don't want to be captain anymore.' After dropping that last sentence, UMP45 quickly left the training ground, leaving only UMP40 standing there in pain.",
    "UMP4501 startedMessageText": "",
    "UMP4501 successMessageText": "",
    "UMP4502_text_01": "Evacuate from any map 4 times",
    "UMP4502_text_02": "Kill 10 PMCs with UMP45 or UMP45 MOD1",
    "UMP4502 name": "Mind Upgrade UMP45 MOD2",
    "UMP4502 description": "UMP45: 'So, commander, 40 is really the best candidate, you should make her the captain.' You: 'Since that's what you say, alright, but there's a mission that needs to be done right now, once you return, I'll appoint 40 as your captain.' The employer was recently angered by USEC's actions, hence he ordered Griffin's dolls to attack the USEC troops stationed in the forest. The attack has been ongoing for 10 minutes, UMP45 continuously adjusts coordination with AK-74M's squad, trying to find a breakthrough in USEC's defense. The encirclement is gradually tightening, the battle has turned into close-quarters cover fighting, yet USEC's excellent combat ability still makes Griffin's dolls' attack extremely difficult. UMP40: 'Ouch!' UMP45: '40? Are you okay?' UMP40: 'My leg has been hit.' UMP45: 'If we keep stalling like this, we'll have to retreat soon, I'll take 40 and go first, 9 stays and moves with AK-74M's squad.' UMP9: 'Be careful, I'll come find you after you retreat.' About ten minutes later, the commander issued the retreat order. By then, the two had already entered deep into the forest. UMP45: 'I'm sorry for what I said.' UMP40: 'It's okay, it's okay, I should be the one apologizing, I shouldn't have put so much pressure on you. I think I just, miss someone too much...' Suddenly, 45 sensed some movement behind them. UMP45: 'Get down, there's someone nearby.' UMP40: 'Looks like, the USECs have come after us. Just to say in advance, if I can't make it back, in my left pocket...' UMP45: 'What are you talking about, I'll definitely bring you back.' UMP45 looked up, only to see five USECs appear in the woods ahead, guns slowly aiming at one of them. UMP40: 'Wait, let's shoot together, I'll take the left one.' UMP40&45: '3, 2, 1!' Gunshots sounded simultaneously, two USECs screamed and fell down. The remaining three USECs called for reinforcements while advancing under the cover of smoke grenades. 40 and 45 peeked out again and fired, each side's gunfire took another down. UMP45: 'No! 40! Wake up, stand up, I still have to bring you back! No! 40, 40!' She watched as 40 lay motionless on the ground, her heart finally broke, tears bursting forth. USECs flanked from both sides of the cover. Suddenly, gunfire came from another direction, the two USECs stopped moving. After a few seconds, footsteps approached. UMP9: 'What are you guys doing... 40, Sister 40 has been destroyed?' UMP45 lay on top of 40, sobbing. UMP45: 'I... failed to protect 40...' Tears quietly ran down 9's cheeks. 9 ran over, looked at 40 lying on the ground, and hugged UMP45. UMP9: 'It's okay...' UMP45: 'I said I'd bring her back...' UMP9: 'Sister 40 still has a chance to come back, but Sister 45, we need to go... if we keep this up, we'll be done for too.' 45 buried her head in 40's chest, her right hand slowly reaching into the left pocket of 40's coat. She lifted her head, through blurry vision, she saw a yellow box in her hand. 45 clenched her hand, wiped the tears from her face. UMP45: 'I can't let 40's body fall into enemy hands.' 45 placed two grenades found on a nearby USEC on 40's chest, arranged 40's hands over the grenades on her chest, pulled the pins, released the handles, and then ran off without looking back. The explosion sounded, the shockwave kicked up dust, knocking leaves off the branches, impacting UMP45's mind.",
    "UMP4502 startedMessageText": "",
    "UMP4502 successMessageText": "",
    "UMP4503_text_01": "Evacuate from any map 5 times",
    "UMP4503_text_02": "Kill 15 PMCs with UMP45, UMP45 MOD1, or UMP45 MOD2",
    "UMP4503 name": "Mind Upgrade UMP45 MOD3",
    "UMP4503 description": "After the operation, in the dormitory, UMP45 took out a yellow box found on 40, containing a small hard drive. 45 connected it to a terminal. Two files appeared on the screen: '509-C Squad Records' 'UMP40 Memory Data (Decrypted)' UMP45 hesitated, then opened the first file. The file bore Griffin's watermark, it was in a semi-decrypted state, many contents unreadable. The captain of 509-C squad was UMP45, precisely, another 'UMP45' from another place, members included UMP40, UMP9, and USP-C, this squad belonged to S██ combat zone, conducted over three hundred operations, of which more than a hundred were performed excellently, and the total number of members destroyed was less than ten. The most excellent operation was █████, in which 509-C squad successfully broke through the encirclement of the riot troops, rescued  s███quad and ██ squad within █████ city, killing over twenty enemies, with no squad members destroyed. On ██/██/████, the main base of S██ combat zone was overrun by enemy forces, 509-C squad went missing during the mission, only UMP40 successfully met up with the reinforcements, the rest of the members were completely destroyed. As the base's database was destroyed, 'UMP45', UMP9, USP-C's mind data were lost, unable to be restored, thus 509-C squad was forced to disband. The next file contained a part of UMP40's memory data, UMP45 randomly opened one of the data. 'UMP45': 'I wonder when we'll get another holiday... recently the number of operations has been increasing, I'm almost dead from exhaustion.' UMP40: 'Hmm, after we get through this riot, there should be one, it'll definitely be a very long holiday then!' UMP9: 'Speaking of which, all the past holidays were just playing around nearby, I really want to go see the big cities.' UMP40: 'I want to play at the beach, although the simulation room has a beach scene, I want to see the beach with my own eyes, I heard sea water is salty, I want to taste what it's like.' UMP9: 'Also, the sea breeze has a unique smell, I really want to know what it's like.' USP-C: 'Hmm... sea water seems to corrode the body...' UMP9: 'It's okay, worst case scenario we come back for a major repair.' 'UMP45': 'Decided then, if we really get such a long holiday, I'll definitely go to a big city with a beach with you guys, it'll definitely be fun!' The memory playback ended, UMP45 sat in the chair silently, after a while, 45 opened the last data. At first, the screen showed a base different from the one they were in, explosions and gunfire were incessant, Molotov cocktails with long flaming tails smashed into collapsing buildings, spreading flames everywhere. The camera turned to another side, a huge gap had been blown open in the base's giant wall, people continuously streamed in through the gap. 'UMP45': 'We need support on the west side, follow me!' Among the collapsing buildings, various flags covered in dust scattered on the ground. After turning a few corners, a nearly collapsed defense line appeared in front, cover had collapsed, the ground scattered with various parts and limbs, bodies of various dolls. Only a few damaged dolls were still stubbornly resisting on the defense line, in front were dense riot troops and armored vehicles. 'UMP45': 'No, the base can't be held.' 'UMP45' tried to contact the reinforcements, but the entire base's communications had already completely broken down. 'UMP45' dropped the communicator, her expression serious as she looked at UMP40 'UMP45': '40, go inform the reinforcement troops, the base can't be held, we'll stay and save as many dolls as we can.' UMP40: 'But... okay, you guys be careful! You have to come back to me!' UMP40 ran towards another direction, before turning the corner, she took one last look in the direction of 45 and the others, just in time to see USP-C being shot down. UMP40: 'USP!... no, I still have a mission.' UMP40 wiped her tears, turned and ran off. The memory playback ended, UMP45 sat in the chair, her tears that had just stopped started flowing again. A few days later, UMP40's mind was downloaded onto a newly assembled body. Angelina: 'Welcome back, UMP40!' UMP40: 'Hello, Miss Angelina.' Angelina: 'Your captain has something to say to you.' UMP40: 'Huh?' UMP45 walked over, holding something in her hand, slapped it on 40's chest. UMP45: 'You went too far!' 40's gaze moved down, pressed against her chest, was a familiar yellow box. UMP40: 'You saw it...' UMP45 hugged 40 UMP45: 'Don't leave me again, 40...' 40's hands gently hugged UMP45 back UMP40: 'Hmm, I won't ever again.'",
    "UMP4503 startedMessageText": "",
    "UMP4503 successMessageText": ""
}